app/controllers/account_controller.rb

SELECT count(*) AS count_all FROM "users"
---
  def index
    redirect_to(:action => 'signup') unless logged_in? || User.count > 0