app/controllers/assignment_participations_controller.rb

  def create
    @assignment_participation.process_params({}.update(params))
---
UPDATE "assignment_participations" SET "state_def_id" = 2, "author_eval" = NULL, "participant_eval" = NULL, "updated_at" = '2009-08-12 14:26:32' WHERE "id" = 1

  def update
    #@assignment_participation = AssignmentParticipation.find(params[:id])
    #@assignment = @assignment_participation.assignment_submission.assignment
    # make sure we are the user of this participation and that it's
    # configured_module is the current one
    if @assignment_participation.user == @user && (@assignment_participation.position == @assignment.current_module(@user).position || @assignment_participation.position == params[:module]+1 && @user != @real_user)
      @assignment_participation.process_params({}.update(params))
---
UPDATE "assignment_participations" SET "state_def_id" = 2, "author_eval" = NULL, "participant_eval" = NULL, "updated_at" = '2009-08-12 05:09:29' WHERE "id" = 1

  def find_assignment
    logger.info("find_assignment")
    @assignment = Assignment.find(params[:assignment_id])
---
SELECT * FROM "assignments" WHERE ("assignments"."id" = 1)

  def find_student
    @real_user = @user
    if !params[:user_id].blank?
      find_assignment if @assignment.nil?
      @user = User.find(params[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def find_assignment_participation
    if params[:id].blank?
      find_assignment
      find_student
      if params[:module].blank?
        @assignment_participation = @assignment.current_module(@user).assignment_participations.first
      elsif @assignment.course.is_assistant?(@real_user)
        @assignment_participation = @assignment.configured_modules(@user)[params[:module].to_i].assignment_participations(true).first
      end
      @assignment_participation.assignment = @assignment
    else
      @assignment_participation = AssignmentParticipation.find(params[:id])
---
SELECT * FROM "assignment_participations" WHERE ("assignment_participations"."id" = 8)