app/controllers/assignments_controller.rb

  def find_assignment
    @assignment = Assignment.find(params[:id])
---
SELECT * FROM "assignments" WHERE (course_id = 1) ORDER BY position DESC LIMIT 1

  def find_course
    @course = Course.find(params[:course_id])
---
SELECT * FROM "courses" WHERE ("courses"."id" = 1)

  def find_student
    @real_user = @user
    if !params[:user_id].blank?
      find_assignment if @assignment.nil?
      @user = User.find(params[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1