app/controllers/courses_controller.rb

SELECT * FROM "courses" WHERE ("courses"."id" = 1)
---
  def find_course
    @course = Course.find(params[:id])

SELECT * FROM "semesters" WHERE ("semesters"."id" = 1)
---
  def find_semester
    @semester = Semester.find(params[:semester_id])