app/controllers/main_controller.rb

  def index
    @user = current_user
    if @user
      n = Time.now
      @current_semesters = Semester.find( :all,
         :conditions => [ 'starts_at <= ? AND ends_at >= ?', n, n ]
      )

      @past_semesters = Semester.find( :all,
         :conditions => [ 'ends_at < ?', n ]
      )

      @future_semesters = Semester.find( :all,
         :conditions => [ 'starts_at > ?', n ]
      )

      @currently_teaching = @user.courses.select { |c| @current_semesters.include?(c.semester) }
      @prev_teaching = @user.courses.select { |c| @past_semesters.include?(c.semester) }
      @will_be_teaching = @user.courses.select { |c| @future_semesters.include?(c.semester) }

      @currently_taking = @user.course_participants.select { |cp| cp.level == 0 && @current_semesters.include?(cp.course.semester) }.map { |cp| cp.course }
---
SELECT * FROM "semesters" WHERE (starts_at <= '2009-08-10 18:57:04' AND ends_at >= '2009-08-10 18:57:04')
SELECT * FROM "courses" WHERE ("courses".user_id = 1)
SELECT * FROM "course_participants" WHERE ("course_participants".user_id = 1)