app/controllers/messages_controller.rb

  def index
    @user = current_user
    @reader = @user

    @assignment_participations = [ ]
    @recipients = [ ]

    if !params[:assignment_id].blank?
      @assignment = Assignment.find(params[:assignment_id])
      @store_url = assignment_messages_path(@assignment)

      if(!@assignment.course.is_student?(@user))
        render :text => 'Forbidden!', :status => 403
      end

    # we want the list of authors we are evaluating and
    # the list of evaluators we are working with
    # for the current assignment module

      @current_module = @assignment.current_module(@user)
      @we_allow_new_messages = false
      if @current_module && @current_module.has_messaging?
        @we_allow_new_messages = true
        r = get_recipients(@current_module)
        @assignment_participations = r[0]
        @recipients = r[1]
      end
    elsif !params[:assignment_submission_id].blank?
      @assignment_submission = AssignmentSubmission.find(params[:assignment_submission_id])
---
SELECT * FROM "assignments" WHERE ("assignments"."id" = 1)
SELECT * FROM "assignment_submissions" WHERE ("assignment_submissions".assignment_id = 1)

      if @user == @assignment_submission.user || @assignment.course.is_assistant?(@user)
        @reader = @assignment_submission.user
        @we_allow_new_messages = false
        @assignment.configured_modules(@assignment_submission.user).select{ |m| (@current_module.nil? || m.position <= @current_module.position ) && m.has_messaging? }.each do |m|
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

      format.html { render :layout => params[:embedded] ? false : 'application' }
      format.ext_json do
        if !params[:assignment_participation_id].blank?
          @messages = Message.find(:all,
            :joins => [ :assignment_participations ],
            :conditions => [
              'assignment_participations.id = ? AND assignment_participations.user_id = ?',
              params[:assignment_participation_id].to_i, @user.id
            ],
            :order => 'id'
          )
---
SELECT assignment_participations.id FROM "assignment_participations" INNER JOIN "assignment_submissions" ON "assignment_submissions".id = "assignment_participations".assignment_submission_id WHERE (assignment_submissions.assignment_id = 1 AND assignment_submissions.user_id = 1) ORDER BY assignment_participations.participant_name
SELECT messages.* FROM "messages" LEFT JOIN assignment_participations ON assignment_participations.id = messages.assignment_participation_id LEFT JOIN assignment_submissions ON assignment_submissions.id = assignment_participations.assignment_submission_id WHERE (assignment_submissions.assignment_id = 1 AND assignment_submissions.user_id = 1) ORDER BY id

  def create
    @user = current_user
    @assignment = Assignment.find(params[:assignment_id])
    @assignment_participation = AssignmentParticipation.find(params[:assignment_participation_id])
    if @assignment_participation.assignment_submission.assignment == @assignment &&
       (@assignment_participation.user == @user || @assignment_participation.assignment_submission.user == @user)
      @message = Message.create(
        :user => @user,
        :assignment_participation => @assignment_participation,
        :subject => params[:message][:subject],
        :content => params[:message][:content]
      );
---
SELECT * FROM "assignments" WHERE ("assignments"."id" = 1)
SELECT * FROM "assignment_participations" WHERE ("assignment_participations"."id" = 1)
INSERT INTO "messages" ("assignment_participation_id", "updated_at", "is_read", "subject", "content", "user_id", "created_at") VALUES(1, '2009-08-31 14:09:02', NULL, 'Some subject or other', 'I think the paper''s not too bad.